app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def create
    @worker = Worker.new(worker_params)

    respond_to do |format|
      if @worker.save
---
INSERT INTO "workers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2024-01-14 05:52:32.791876"], ["updated_at", "2024-01-14 05:52:32.791876"]]

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]